#include <iostream>

using namespace std;

int main()
{
	cout<<1<<2<<endl;
	cout<<(1<<2)<<endl; // Оператор << не ассоциативен
	cout<<(7>>2)<<endl;
	//cout<<(7.5>>2)<<endl; // Нельзя сдвигать дробные
	short sh=73;
	cout<<(sh>>2)<<" "<<(sh<<3)<<endl;
	bool b=true;
	cout<<(b<<2)<<endl; // Интегральное повышение
	unsigned short ush=~0; // Поразрядное отрицание нуля есть максимальное число
	// (для беззнаковых типов)
	cout<<ush<<" "
	    <<(ush<<2) // Здесь происходит интегральное повышение, переполнения не происходит
	    <<" "<<(unsigned short)(ush<<2) // А здесь - переполнение
	    <<" "<<(ush>>2)<<endl;
	return 0;
}
/*
12
4
1
18 584
4
65535 262140 65532 16383
*/
