/*
С клавиатуры вводится массив из 10 элементов и число n от 0 до 10.
Выведите на экран сумму элементов массива, начиная с n.
*/

#include <iostream>
using namespace std;

void input_array(int mas[], int size){
	cout << "Введите массив из " << size << " элементов" << endl;
	for (int i = 0; i < size; i++) {
		cin >> mas[i];
	}
}	

int main(){
	
	/* Раскомментировать после отладки
	// {{ "Честный" ввод
	int mas[10];
	input_array(mas, 10);
	// }} "Честный" ввод
	*/
	// {{ Отладочная фиксация - удалить в конце отладки
	int mas[10] = {10,11,12,13,14,15,16,17,18,19};
	// }} Отладочная фиксация
	
	int n;
	cout << "Введите индекс, с которого начинаем суммирование:" << endl;
	cin >> n;

	// {{ Вывод массива
	cout << "Исходный массив:" << endl;
	for (int i = 0; i < 10; i++) {
		cout << mas[i] << " ";
	}
	cout << endl;
	// }} Вывод массива
	
	// {{ Подсчёт суммы
	int sum = mas[n];
	for (int i = n + 1; i < 10; i++) {
		sum += mas[i];
	}
	// }} Подсчёт суммы
	cout << "Сумма элементов, начиная с " << n <<"-го, равна " << sum << endl;

	cout << endl;
	return 0;
}
