/*
С клавиатуры вводится массив из 10 элементов и число n от 0 до 10.
Выведите на экран сумму элементов массива, начиная с n.
*/

#include <iostream>
using namespace std;

int main(){

	/* Раскомментировать после отладки
	// {{ "Честный" ввод
	cout << "Введите массив из 10 элементов" << endl;
	int mas[10];
	for (int i = 0; i < 10; i++) {
		cin >> mas[i];
	}
	cout << "Введите индекс, с которого начинаем суммирование:" << endl;
	int n;
	cin >> n;
	// }} "Честный" ввод
	*/

	// {{ Отладочная фиксация - удалить в конце отладки
	int n = 3;
	// Так можно писать только вместе с объявлением массива!
	int mas[10] = {10,11,12,13,14,15,16,17,18,19};
	// Держим наготове второй вариант, при необходимости переключаемся между вариантами,
	// вставляя или убирая "//" на этапе компиляции
	//int mas[10] = {-10,11,12,-13,14,-15,-16,17,18,99};
	// Можем и третий, что нам стОит?
	//int mas[10] = {-10,11,12,-13,14,-15,-16,17,18,99};
	// Главное, чтобы при компиляции "открыт" был только один,
	// а остальные были закомментированы
	// }} Отладочная фиксация

	// {{ Вывод массива
	cout << "Исходный массив:" << endl;
	for (int i = 0; i < 10; i++) {
		cout << mas[i] << " ";
	}
	cout << endl;
	// }} Вывод массива

	// {{ Подсчёт суммы
	int sum = mas[n];
	for (int i = n + 1; i < 10; i++) {
		sum += mas[i];
	}
	// }} Подсчёт суммы
	cout << "Сумма элементов, начиная с " << n << "-го, равна " << sum << endl;

	cout << endl;
	return 0;
}
