/*
С клавиатуры вводится массив целых чисел.
Удалить строки массива, начинающиеся с 0.
*/



#include <iostream>
using namespace std;

int main(){
	const int rows = 5; // Количество строк
	const int cols = 2; // Количество столбцов
	
	int mas[rows][cols];
	
	//{{ Ввод массива с клавиатуры
	for (int i = 0; i < rows; i++) {
		for (int j = 0; j < cols; j++) {
			cin >> mas[i][j];
		}
	}
	//}} Ввод массива с клавиатуры

	//{{ Обработка массива
	int h = 0; // Номер строки
	for (int i = 0; i < rows; i++) {
		//i - номер строки, j - номер столбца
		
		// Если нулевой элемент i-й строки -  не ноль,
		// то копируем i-ю строку в h-ю строку
		// Заметим, что всегда i>=h, т.е. эта операция не портит
		// те строки, которые ещё не изучены
		if (mas[i][0] != 0) {
			for (int j = 0; j < cols; j++) {
				mas[h][j] = mas[i][j];
			}
			h++; // Увеличиваем номер строки, в которую будем писать
		}
	}
	//}} Обработка массива

	//{{ Вывод массива на экран
	for (int i = 0; i < rows; i++) {
		for (int j = 0; j < cols; j++) {
			cout << mas[i][j];
		}
	}
	//}} Вывод массива на экран

	cout << endl;
	return 0;

}
