#include <iostream>
using namespace std;

int g=0;

// Функция принимает два параметра - ссылки на int
// Если второй параметр не указан, то используется ссылка на глобальную переменную g
void swapInt(int& a, int& b=g){
	// Просто  меняем местами две переменные (т. е. меняем местами их значения)
	// Глобальная переменная g используется как буфер на случай,
	// если функция вызвана с одним аргументом
	int buf=a;
	a=b;
	b=buf;
}

int main() {
	int i1=1,i2=2,i3=3,i4=4;
	swapInt(i1,i2);
	cout<<i1<<" "<<i2<<endl;
	swapInt(i3);
	cout<<i3<<" "<<g<<endl;
	swapInt(i4);
	cout<<i4<<" "<<g<<endl;
	return 0;
}
